class ServiceTestData:
    AUTH_NAME = 'Иван'
    AUTH_LAST_NAME = 'Иванов'
    AUTH_ADDRESS = 'Комсомольская 54'
    AUTH_PHONE = '89500676536'


class Urls:
    Scooter = 'https://qa-scooter.praktikum-services.ru/'


class TextQuestions:
    FIRST_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    SECOND_TEXT = ('Пока что у нас так: один заказ — один самокат. '
                   'Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.')
    THIRD_TEXT = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. '
                  'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру.'
                  ' Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.')
    FOURTH_TEXT = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    FIFTH_TEXT = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    SIXTH_TEXT = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — '
                  'даже если будете кататься без передышек и во сне. Зарядка не понадобится.')
    SEVEN_TEXT = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    EIGHT_TEXT = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
